_Rarzrabotki/Rarus/USO2/Documents/УСОERP_БазаРаспределенияНакладныхРасходов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<Document>
		<Properties>
			<Name>УСОERP_БазаРаспределенияНакладныхРасходов</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.УСОERP_БазаРаспределенияПлановыхНакладныхРасходов</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ОбъектСтроительства</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СМ_ОбъектыСтроительства</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СценарийПланирования</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УСОERP_СценарииПланированияПроектовСтроительства</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтатьяРасходов</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ГруппыФинансовогоУчетаДоходовРасходов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументОснование</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.УСОERP_УтверждениеКалендарногоПланаГрафика</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаправлениеДеятельности</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.НаправленияДеятельности</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ОбъектыРасценки</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Отметка</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидРаспределения</Name>
							<Type>
								<v8:Type>cfg:EnumRef.УСОERP_ТипыЗатратДляРасценкиПроекта</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Работа</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.УСОERP_СтроительныеРаботы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Ресурс</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.УСОERP_Ресурсы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОбъектРасценки</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
								<v8:Type>cfg:CatalogRef.Должности</v8:Type>
								<v8:Type>cfg:CatalogRef.УСОERP_Ресурсы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

_Rarzrabotki/Rarus/USO2/Documents/УСОERP_БазаРаспределенияНакладныхРасходов/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область Проведение

Процедура ИнициализироватьДанныеДокумента(ДокументСсылка, ДополнительныеСвойства, Регистры = Неопределено) Экспорт
	
	////////////////////////////////////////////////////////////////////////////
	// Создадим запрос инициализации движений
	
	Запрос = Новый Запрос;
	ЗаполнитьПараметрыИнициализации(Запрос, ДокументСсылка);
	
	////////////////////////////////////////////////////////////////////////////
	// Сформируем текст запроса
	
	ТекстыЗапроса = Новый СписокЗначений;
	ТекстыЗапроса.Добавить(ТекстЗапросаТаблицыБазыРаспределения(),		"ТаблицаБазыРаспределения");
	

	Запрос.Текст = "";
	Для Каждого ТекстЗапроса из ТекстыЗапроса Цикл
		Запрос.Текст = Запрос.Текст + ТекстЗапроса.Значение;
	КонецЦикла;
	
	////////////////////////////////////////////////////////////////////////////
	// Выполним запрос
	
	Результат = Запрос.ВыполнитьПакет();
	
	////////////////////////////////////////////////////////////////////////////
	// Поместим результаты запроса в дополнительные свойства
	
	Для Каждого ТекстЗапроса из ТекстыЗапроса Цикл
		ИмяТаблицы = ТекстЗапроса.Представление;
		Если Не ПустаяСтрока(ИмяТаблицы) Тогда
			Индекс = ТекстыЗапроса.Индекс(ТекстЗапроса);
			ДополнительныеСвойства.ТаблицыДляДвижений.Вставить(ИмяТаблицы, Результат[Индекс].Выгрузить());
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

Процедура ЗаполнитьПараметрыИнициализации(Запрос, ДокументСсылка)
	
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	Запрос.УстановитьПараметр("Ссылка", ДокументСсылка);
	Запрос.Текст = "ВЫБРАТЬ
	               |	УСОERP_БазаРаспределенияНакладныхРасходов.Дата КАК Период,
	               |	УСОERP_БазаРаспределенияНакладныхРасходов.Ссылка КАК Ссылка,
	               |	УСОERP_БазаРаспределенияНакладныхРасходов.ОбъектСтроительства,
	               |	УСОERP_БазаРаспределенияНакладныхРасходов.СценарийПланирования,
	               |	УСОERP_БазаРаспределенияНакладныхРасходов.Организация КАК Организация
	               |ИЗ
	               |	Документ.УСОERP_БазаРаспределенияНакладныхРасходов КАК УСОERP_БазаРаспределенияНакладныхРасходов
	               |ГДЕ
	               |	УСОERP_БазаРаспределенияНакладныхРасходов.Ссылка = &Ссылка";
	Реквизиты = Запрос.Выполнить().Выбрать();
	Реквизиты.Следующий();
	//
	Запрос.УстановитьПараметр("ОбъектСтроительства",	Реквизиты.ОбъектСтроительства);
	Запрос.УстановитьПараметр("СценарийПланирования",	Реквизиты.СценарийПланирования);
	Запрос.УстановитьПараметр("Период",					Реквизиты.Период);
	Запрос.УстановитьПараметр("Организация",			Реквизиты.Организация);
		
КонецПроцедуры

Функция ТекстЗапросаТаблицыБазыРаспределения()
	
	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	УСОERP_БазаРаспределенияНакладныхРасходовОбъектыРасценки.Ссылка КАК Регистратор,
	|	УСОERP_БазаРаспределенияНакладныхРасходовОбъектыРасценки.Ссылка.Дата КАК Период,
	|	УСОERP_БазаРаспределенияНакладныхРасходовОбъектыРасценки.Ссылка.Организация КАК Организация,
	|	УСОERP_БазаРаспределенияНакладныхРасходовОбъектыРасценки.Ссылка.ОбъектСтроительства КАК ОбъектСтроительства,
	|	УСОERP_БазаРаспределенияНакладныхРасходовОбъектыРасценки.Ссылка.СценарийПланирования КАК СценарийПланирования,
	|	УСОERP_БазаРаспределенияНакладныхРасходовОбъектыРасценки.Ссылка.СтатьяРасходов КАК СтатьяРасходов,
	|	УСОERP_БазаРаспределенияНакладныхРасходовОбъектыРасценки.Отметка КАК Отметка,
	|	ВЫБОР
	|		КОГДА УСОERP_БазаРаспределенияНакладныхРасходовОбъектыРасценки.Работа.РаботаИсточник = ЗНАЧЕНИЕ(Справочник.УСОERP_СтроительныеРаботы.ПустаяСсылка)
	|			ТОГДА УСОERP_БазаРаспределенияНакладныхРасходовОбъектыРасценки.Работа
	|		ИНАЧЕ УСОERP_БазаРаспределенияНакладныхРасходовОбъектыРасценки.Работа.РаботаИсточник
	|	КОНЕЦ КАК Работа
	|ИЗ
	|	Документ.УСОERP_БазаРаспределенияНакладныхРасходов.ОбъектыРасценки КАК УСОERP_БазаРаспределенияНакладныхРасходовОбъектыРасценки
	|ГДЕ
	|	УСОERP_БазаРаспределенияНакладныхРасходовОбъектыРасценки.Ссылка = &Ссылка
	|	И НЕ УСОERP_БазаРаспределенияНакладныхРасходовОбъектыРасценки.Работа.СуммарнаяРабота	
	|;
	|////////////////////////////////////////////////////////////////////////////////
	|";
	
	Возврат ТекстЗапроса;
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область Отчеты
// Определяет список команд отчетов.
//
// Параметры:
//   КомандыОтчетов - ТаблицаЗначений - Таблица с командами отчетов. Для изменения.
//       См. описание 1 параметра процедуры ВариантыОтчетовПереопределяемый.ПередДобавлениемКомандОтчетов().
//   Параметры - Структура - Вспомогательные параметры. Для чтения.
//       См. описание 2 параметра процедуры ВариантыОтчетовПереопределяемый.ПередДобавлениемКомандОтчетов().
//
Процедура ДобавитьКомандыОтчетов(КомандыОтчетов, Параметры) Экспорт
	
	ВариантыОтчетовУТПереопределяемый.ДобавитьКомандуСтруктураПодчиненности(КомандыОтчетов);
	
КонецПроцедуры

#КонецОбласти


#Область Печать

// Заполняет список команд печати.
// 
// Параметры:
//   КомандыПечати - ТаблицаЗначений - состав полей см. в функции УправлениеПечатью.СоздатьКоллекциюКомандПечати
//
Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт

КонецПроцедуры

#КонецОбласти

#Область СозданиеНаОсновании

// Заполняет список команд создания на основании.
// 
// Параметры:
//   КомандыСоздатьНаОсновании - ТаблицаЗначений - состав полей см. в функции ВводНаОсновании.СоздатьКоллекциюКомандСоздатьНаОсновании
//
Процедура ДобавитьКомандыСозданияНаОсновании(КомандыСоздатьНаОсновании, Параметры) Экспорт
	
	
КонецПроцедуры

//// Заполняет список команд создания на основании.
//// 
//// Параметры:
////   КомандыСоздатьНаОсновании - ТаблицаЗначений - состав полей см. в функции ВводНаОсновании.СоздатьКоллекциюКомандСоздатьНаОсновании
////
//// Возвращаемое значение:
////	 КомандыСоздатьНаОсновании - ТаблицаЗначений - состав полей см. в функции ВводНаОсновании.СоздатьКоллекциюКомандСоздатьНаОсновании
////
Функция ДобавитьКомандуСоздатьНаОсновании(КомандыСоздатьНаОсновании) Экспорт
	
	КомандаСоздатьНаОсновании = КомандыСоздатьНаОсновании.Добавить();
	КомандаСоздатьНаОсновании.Менеджер = Метаданные.Документы.УСОERP_БазаРаспределенияНакладныхРасходов.ПолноеИмя();
	КомандаСоздатьНаОсновании.Представление = ОбщегоНазначенияУТ.ПредставлениеОбъекта(Метаданные.Документы.УСОERP_БазаРаспределенияНакладныхРасходов);
	КомандаСоздатьНаОсновании.РежимЗаписи = "Проводить";
	
	Возврат КомандаСоздатьНаОсновании;
	
КонецФункции

#КонецОбласти 


#КонецОбласти

#КонецЕсли
